circular-cylinder-re20-A22/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
   // each entry is a separate probe 
   // make sure to change (x1 y1 z1) and (x2 y2 z2) to
   // the probe coordinates

   (.3889 .3889 0.0)
   (.4243 .4243 0.0)
   (.4596 .4596 0.0)
   (0 .55 0.0)
   (0 .60 0.0)
   (0 .65 0.0)
   (.3889 -.3889 0.0)
   (.4243 -.4243 0.0)
   (.4596 -.4596 0.0)

   
   
);

// ************************************************************************* //
